In [1]:
# Lambda functions

In [3]:
#square each number
num=[2, 5, 8, 10]
square=list(map(lambda x: x*x,num))
print(square)

[4, 25, 64, 100]

In [13]:
# string to int
a=["10", "20", "30"]
to_int=list(map( int, a))
print(to_int)

[10, 20, 30]

In [15]:
#keep only even numbers.
all=[1, 2, 3, 4, 5, 6]
even=list(filter(lambda x:x%2==0,all))
print(even)

[2, 4, 6]

In [17]:
#keep words with length â‰¥ 4.
a=["hi", "hello", "sun", "world"]
b=list(filter(lambda x : len(x)>=4,a))
print(b)

['hello', 'world']

In [21]:
#add 10 to each number.
a=[1, 2, 3, 4]
b=list(map(lambda x : x+10,a))
print(b)

[11, 12, 13, 14]

In [25]:
#Multiply all numbers
from functools import reduce
a=[2, 3, 4]
print(reduce(lambda x,y:x*y,a))

24

In [31]:
#Find the longest string
s=["cat", "elephant", "dog", "mouse"]
print(reduce(lambda x,y:x if len(x)>len(y) else y,s))

elephant

In [33]:
#Square only even numbers
a=[1, 2, 3, 4, 5, 6]
b=list(map(lambda y : y*y,filter(lambda x: x%2==0,a)))
print(b)

[4, 16, 36]

In [45]:
#Count numbers greater than 50
a=[10, 60, 40, 90, 80]
print(len(list(filter(lambda x : x>50,a))))

3

In [53]:
#Remove duplicates using reduce
a=[1, 2, 2, 3, 4, 4, 5]
#print(list(reduce(lambda x,y: x if x==y else ,a)))
print(list(set(a)))

[1, 2, 3, 4, 5]

In [59]:
#numpy
import numpy as np
print(np.arange(1,21))

[ 1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20]

In [69]:
x=np.zeros((5,5))
print(x)
x[2,2]=1
print(x)

[[0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0.]]
[[0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0.]
 [0. 0. 1. 0. 0.]
 [0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0.]]

In [71]:
print(np.eye(3))

[[1. 0. 0.]
 [0. 1. 0.]
 [0. 0. 1.]]

In [77]:
print(np.random.randint(1,100,10))

[35 96 72 39 53 68 26 82  5 39]

In [81]:
a = np.array([10, 20, 30, 40, 50])
print(a.max(),'\n',np.sum(a),'\n',np.mean(a),'\n',len(a),'\n',a.min())

50
 150
 30.0
 5
 10

In [95]:
a=np.arange(1,21)
a
print(list(filter(lambda x : x%2==0,a)))

[2, 4, 6, 8, 10, 12, 14, 16, 18, 20]

In [101]:
x=np.random.randint(1,100,21)
x
x[x>50]=50
print(x)

[29 50 19 19 50 50  1 50 50 50  6 43 50 50  5 29 50 41 34 50 50]

In [111]:
a = np.array([1,2,3])
b = np.array([4,5,6])
print(np.vstack([a,b]))
print(np.hstack([a,b]))

[[1 2 3]
 [4 5 6]]
[1 2 3 4 5 6]

In [113]:
x=x[::-1]
print(x)

[50 50 34 41 50 29  5 50 50 43  6 50 50 50  1 50 50 19 19 50 29]

In [121]:
print(np.where(x>10))

(array([ 0,  1,  2,  3,  4,  5,  7,  8,  9, 11, 12, 13, 15, 16, 17, 18, 19,
       20], dtype=int64),)

In [133]:
a=np.random.randint(1,100,36)
print(a)
b=a.reshape(6,6)
print(b)

[89 19 41 65 48 23 86 15 53 19 78 83  6  9 37 70 49 14 45 40 68 32 67 89
 49 89 77 20  7 19 87 52 84 59 54 57]
[[89 19 41 65 48 23]
 [86 15 53 19 78 83]
 [ 6  9 37 70 49 14]
 [45 40 68 32 67 89]
 [49 89 77 20  7 19]
 [87 52 84 59 54 57]]

In [143]:
print(b[:2])

[[89 19 41 65 48 23]
 [86 15 53 19 78 83]]

In [149]:
print(b[:,3:6])

[[65 48 23]
 [19 78 83]
 [70 49 14]
 [32 67 89]
 [20  7 19]
 [59 54 57]]

In [151]:
print(b[2:5,2:5])

[[37 70 49]
 [68 32 67]
 [77 20  7]]

In [165]:
a=np.random.randint(1,10,size=(5,5))
print(np.sum(a,axis=1))#rows
print(np.sum(a,axis=0))#columns

[30 22 29 27 19]
[26 22 27 23 29]

In [167]:
m=np.random.normal(loc=0,scale=1,size=(4,4))
print(m)

[[-0.59607943  1.40335591  0.59286167 -0.64293768]
 [-0.04312794  0.73722913 -1.65068397  0.13310351]
 [-0.70186475 -0.98685892 -0.29005615 -0.9981268 ]
 [-0.73735991 -0.55434226 -0.45725175  0.87334862]]

In [17]:
a=np.linspace(1,10,5)
print(a)

[ 1.    3.25  5.5   7.75 10.  ]

In [3]:
#Pandas
#--Series
import pandas as pd
import numpy as np

In [5]:
a=pd.Series()
print(a)

Series([], dtype: object)

In [11]:
# from array
a=np.array([23,56,78,90])
print(pd.Series(a))

0    23
1    56
2    78
3    90
dtype: int32

In [13]:
# from list
a=['jcb','mrf','creat','adv']
print(pd.Series(a))

0      jcb
1      mrf
2    creat
3      adv
dtype: object

In [15]:
# from dict

a={'Geeks': 10, 'for': 20, 'geeks': 30}
print(pd.Series(a))

Geeks    10
for      20
geeks    30
dtype: int64

In [19]:
# from linspace numpy
a=pd.Series(np.linspace(1,10,5))
print(a)

0     1.00
1     3.25
2     5.50
3     7.75
4    10.00
dtype: float64

In [27]:
a=range(1,10,4)
print(a)
print(np.arange(1,10,4))

range(1, 10, 4)
[1 5 9]

In [29]:
# from range
a=pd.Series(range(5,15))
print(a)

0     5
1     6
2     7
3     8
4     9
5    10
6    11
7    12
8    13
9    14
dtype: int64

In [43]:
# from range abd index setting
a=pd.Series(range(1,20,3),index=[x for x in 'abcdefg'])
print(a)

a     1
b     4
c     7
d    10
e    13
f    16
g    19
dtype: int64

In [45]:
# Accessing through indexes and elements(slices)

a=np.array(['g', 'e', 'e', 'k', 's', 'f',
                 'o', 'r', 'g', 'e', 'e', 'k', 's'])
ser=pd.Series(a)
print(ser[0])

g

In [47]:
#first five
print(ser[:5])

0    g
1    e
2    e
3    k
4    s
dtype: object

In [49]:
# last 10
print(ser[-10:])

3     k
4     s
5     f
6     o
7     r
8     g
9     e
10    e
11    k
12    s
dtype: object

In [51]:
# Accessing with label index
data=np.array(['g', 'e', 'e', 'k', 's', 'f','o', 'r', 'g', 'e', 'e', 'k', 's'])
ser=pd.Series(data,index=[10, 11, 12, 13, 14,15, 16, 17, 18, 19, 20, 21, 22])
print(ser[15])

f

In [53]:
#accessing multiple elements with index label
print(ser[[10,18,17,16,15,21]])

10    g
18    g
17    r
16    o
15    f
21    k
dtype: object

In [65]:
ser=pd.Series(np.arange(3,9),index=['a', 'b', 'c', 'd', 'e', 'f'])
print(ser[['b', 'c', 'd', 'e']])

b    4
c    5
d    6
e    7
dtype: int32

In [75]:
s1 = pd.Series([10, 20, 30], index=['a', 'b', 'c'])
s2 = pd.Series([1, 2, 30], index=['a', 'b', 'c'])

print(s1+s2)

####Theindexes should always match otherwise it gives NaaN values

a    11
b    22
c    60
dtype: int64

In [77]:
print(s1==s2)

a    False
b    False
c     True
dtype: bool

In [87]:
df1=pd.DataFrame({'A':[1,2,3,4,5],'B':[23,56.8,87,5,80]})
df2=pd.DataFrame({'A':[5,78,3,4,0],'B':[2,6.8,78,51,0.1]})
result=df1-df2
print(result)

    A     B
0  -4  21.0
1 -76  50.0
2   0   9.0
3   0 -46.0
4   5  79.9

In [89]:
print(df1>df2)

       A      B
0  False   True
1  False   True
2  False   True
3  False  False
4   True   True

In [95]:
df1=pd.DataFrame({'A':[1,2,3,None],'B':[23,56.8,87,None]})
df2=pd.DataFrame({'A':[None,78,3,4],'B':[2,6.8,78,51]})
print(df1>df2)
print(df1+df2)
print(df1==df2)

       A      B
0  False   True
1  False   True
2  False   True
3  False  False
      A      B
0   NaN   25.0
1  80.0   63.6
2   6.0  165.0
3   NaN    NaN
       A      B
0  False  False
1  False  False
2   True  False
3  False  False

In [101]:
# Index attribute
s1 = pd.Series([10, 20, 30], index=['a', 'b', 'c'])
print("Before index : ",s1.index)
s1.index=['x','y','z']
print("\nAfter Index : ",s1.index)
print(s1)

Before index :  Index(['a', 'b', 'c'], dtype='object')

After Index :  Index(['x', 'y', 'z'], dtype='object')
x    10
y    20
z    30
dtype: int64

In [105]:
# Pandas can even allow same indexes 
series=pd.Series(['New York','Toronto','Chicago','Vancover'])
series.index=['City 1','City 2','City 1','City 2']
print(series)

City 1    New York
City 2     Toronto
City 1     Chicago
City 2    Vancover
dtype: object

In [109]:
series[['City 1','City 2']]

City 1    New York
City 1     Chicago
City 2     Toronto
City 2    Vancover
dtype: object

In [111]:
series[:3]

City 1    New York
City 2     Toronto
City 1     Chicago
dtype: object

In [113]:
days=['6/11/2000','11/02/2000','05/07/1998','13/11/1997']
idx=['Bunny','Adi','Munny','Bittu']
data=pd.Series(days,index=idx)
print(data)

Bunny     6/11/2000
Adi      11/02/2000
Munny    05/07/1998
Bittu    13/11/1997
dtype: object

In [115]:
days=['6/11/2000','11/02/2000','05/07/1998','13/11/1997']
idx=['Bunny','Adi','Munny','Bittu']
data=pd.Series(days,index=idx)
print(data)
#resetting index to default
data.reset_index(drop=True,inplace=True)
print(data)

Bunny     6/11/2000
Adi      11/02/2000
Munny    05/07/1998
Bittu    13/11/1997
dtype: object
0     6/11/2000
1    11/02/2000
2    05/07/1998
3    13/11/1997
dtype: object

In [119]:
#Pandas DataFrame
lst = ['Geeks', 'For', 'Geeks', 'is', 'portal', 'for', 'Geeks']
df=pd.DataFrame(lst)
print(df)

        0
0   Geeks
1     For
2   Geeks
3      is
4  portal
5     for
6   Geeks

In [135]:
lst = [['a','b','m'],['c','n','u'],['p','i']]
df=pd.DataFrame(lst,columns=[1,2,3])
print(df)

   1  2     3
0  a  b     m
1  c  n     u
2  p  i  None

In [131]:
dict={'name':['Bunny','Munny','Sweety'],
     'age':[25,27,26]}
print(dict)
df=pd.DataFrame(dict)
sr=pd.Series(dict)
print(sr)
print(df)

{'name': ['Bunny', 'Munny', 'Sweety'], 'age': [25, 27, 26]}
name    [Bunny, Munny, Sweety]
age               [25, 27, 26]
dtype: object
     name  age
0   Bunny   25
1   Munny   27
2  Sweety   26

In [145]:
data=[['tom',10],['nick',12],['will',14]]
df=pd.DataFrame(data,columns=['Name','Age'],index=['Youngest','Middle','Eldest'])
print(df)

          Name  Age
Youngest   tom   10
Middle    nick   12
Eldest    will   14

In [159]:
df2=df[['Name']]
print(df2)

          Name
Youngest   tom
Middle    nick
Eldest    will

In [163]:
# DataFrame from Series
d={'one':pd.Series([10,20,30],index=[1,2,3]),'two':pd.Series([45,55,65],index=[1,2,3])}
df=pd.DataFrame(d)
print(df)

   one  two
1   10   45
2   20   55
3   30   65

In [175]:
# If given two lists
# List1
Name = ['tom', 'krish', 'nick', 'juli']

# List2
Age = [25, 30, 26, 22]

super_list=list(zip(Name,Age))
print(super_list)
df=pd.DataFrame(super_list,columns=['Name','Age'])
print(df)

[('tom', 25), ('krish', 30), ('nick', 26), ('juli', 22)]
    Name  Age
0    tom   25
1  krish   30
2   nick   26
3   juli   22

In [177]:
df

    Name  Age
0    tom   25
1  krish   30
2   nick   26
3   juli   22

In [179]:
data = {'Name': ['John', 'Alice', 'Bob', 'Eve', 'Charlie'],
        'Age': [25, 30, 22, 35, 28],
        'Gender': ['Male', 'Female', 'Male', 'Female', 'Male'],
        'Salary': [50000, 55000, 40000, 70000, 48000]}

# Setting index
#Resetting index
#loc > locating the value and its info

df=pd.DataFrame(data)
print(df)
print(df.index)

      Name  Age  Gender  Salary
0     John   25    Male   50000
1    Alice   30  Female   55000
2      Bob   22    Male   40000
3      Eve   35  Female   70000
4  Charlie   28    Male   48000
RangeIndex(start=0, stop=5, step=1)

In [187]:
df1=df.set_index('Name')
print(df1)

         Age  Gender  Salary
Name
John      25    Male   50000
Alice     30  Female   55000
Bob       22    Male   40000
Eve       35  Female   70000
Charlie   28    Male   48000

In [203]:
df2=df.reset_index()

In [211]:
df1.loc['Alice','Age']

30

In [213]:
df

      Name  Age  Gender  Salary
0     John   25    Male   50000
1    Alice   30  Female   55000
2      Bob   22    Male   40000
3      Eve   35  Female   70000
4  Charlie   28    Male   48000

In [217]:
df.loc[1,'Gender']

'Female'

In [219]:
df.loc[:,['Name','Age']]

      Name  Age
0     John   25
1    Alice   30
2      Bob   22
3      Eve   35
4  Charlie   28

In [223]:
df.loc[:,'Name':'Gender']

      Name  Age  Gender
0     John   25    Male
1    Alice   30  Female
2      Bob   22    Male
3      Eve   35  Female
4  Charlie   28    Male

In [225]:
#Select Alternate Rows or Columns
df.loc[::2,::2]

      Name Gender
0     John   Male
2      Bob   Male
4  Charlie   Male

In [227]:
df.iloc[::2]

      Name  Age Gender  Salary
0     John   25   Male   50000
2      Bob   22   Male   40000
4  Charlie   28   Male   48000

In [231]:
#df.loc is label positioning
# df.iloc is integer posotioning
df.loc[0,'Age']

25

In [4]:
df={'Name': ['John', 'Alice', 'Bob', 'Eve', 'Charlie'], 
        'Age': [25, 30, 22, 35, 28], 
        'Gender': ['Male', 'Female', 'Male', 'Female', 'Male'], 
        'Salary': [50000, 55000, 40000, 70000, 48000]}

df=pd.DataFrame(df)
df

      Name  Age  Gender  Salary
0     John   25    Male   50000
1    Alice   30  Female   55000
2      Bob   22    Male   40000
3      Eve   35  Female   70000
4  Charlie   28    Male   48000

In [5]:
age_column=df['Age']
print(age_column)

0    25
1    30
2    22
3    35
4    28
Name: Age, dtype: int64

In [7]:
second_row=df.loc[1]
second_row

Name       Alice
Age           30
Gender    Female
Salary     55000
Name: 1, dtype: object

In [9]:
a=df.iloc[1]
a

Name       Alice
Age           30
Gender    Female
Salary     55000
Name: 1, dtype: object

In [10]:
subset = df.loc[:2,['Name','Salary']]
print(subset)

    Name  Salary
0   John   50000
1  Alice   55000
2    Bob   40000

In [11]:
# Access rows where 'Age' is greater than 25
filtered_data=df[df['Age']>25]
print(filtered_data)

      Name  Age  Gender  Salary
1    Alice   30  Female   55000
3      Eve   35  Female   70000
4  Charlie   28    Male   48000

In [12]:
# Accessing Specific Cells with at and iat
salary_at_index_4= df.at[4,'Salary']
print(salary_at_index_2)

48000

In [13]:
x=df.iat[3,3]
print(x)

70000

In [14]:
### ---- at, iat gives only single value. they are faster than loc and iloc.
#### this cannot accept df.at[3:6, 4:2] return error because it give only single value

In [20]:
df=pd.read_csv("C:/Users/Sreemayi Dontha/Downloads/nba.csv")
df.head(5)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [21]:
df=pd.read_csv("C:/Users/Sreemayi Dontha/Downloads/nba.csv",index_col="Name")
df

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...
Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [22]:
df_age=df['Age']
df_age.head(5)

Name
Avery Bradley    25.0
Jae Crowder      25.0
John Holland     27.0
R.J. Hunter      22.0
Jonas Jerebko    29.0
Name: Age, dtype: float64

In [23]:
df_multiple=df[['Team','Height','Salary']]
df_multiple.head(10)

                         Team Height      Salary
Name
Avery Bradley  Boston Celtics    6-2   7730337.0
Jae Crowder    Boston Celtics    6-6   6796117.0
John Holland   Boston Celtics    6-5         NaN
R.J. Hunter    Boston Celtics    6-5   1148640.0
Jonas Jerebko  Boston Celtics   6-10   5000000.0
Amir Johnson   Boston Celtics    6-9  12000000.0
Jordan Mickey  Boston Celtics    6-8   1170960.0
Kelly Olynyk   Boston Celtics    7-0   2165160.0
Terry Rozier   Boston Celtics    6-2   1824360.0
Marcus Smart   Boston Celtics    6-4   3431040.0

In [24]:
df_single_row=df.loc['Terry Rozier']
print(df_single_row)

Team        Boston Celtics
Number                12.0
Position                PG
Age                   22.0
Height                 6-2
Weight               190.0
College         Louisville
Salary           1824360.0
Name: Terry Rozier, dtype: object

In [26]:
#selecting multiple rows by label
df_multiple_rows=df.loc[['John Holland','Terry Rozier','Marcus Smart']]
print(df_multiple_rows)

                        Team  Number Position   Age Height  Weight  \
Name
John Holland  Boston Celtics    30.0       SG  27.0    6-5   205.0
Terry Rozier  Boston Celtics    12.0       PG  22.0    6-2   190.0
Marcus Smart  Boston Celtics    36.0       PG  22.0    6-4   220.0

                        College     Salary
Name
John Holland  Boston University        NaN
Terry Rozier         Louisville  1824360.0
Marcus Smart     Oklahoma State  3431040.0

In [27]:
#Selecting Specific Rows and Columns
df12=df.loc[['John Holland','Terry Rozier'],['Age','Height','Salary']]
print(df12)

               Age Height     Salary
Name
John Holland  27.0    6-5        NaN
Terry Rozier  22.0    6-2  1824360.0

In [30]:
#Selecting All Rows and Specific Columns
df11=df.loc[:,['Height','Salary']]
print(df11)

              Height     Salary
Name
Avery Bradley    6-2  7730337.0
Jae Crowder      6-6  6796117.0
John Holland     6-5        NaN
R.J. Hunter      6-5  1148640.0
Jonas Jerebko   6-10  5000000.0
...              ...        ...
Shelvin Mack     6-3  2433333.0
Raul Neto        6-1   900000.0
Tibor Pleiss     7-3  2900000.0
Jeff Withey      7-0   947276.0
NaN              NaN        NaN

[458 rows x 2 columns]

In [31]:
#Selecting a Single Row by Position
print(df.iloc[3])

Team        Boston Celtics
Number                28.0
Position                SG
Age                   22.0
Height                 6-5
Weight               185.0
College      Georgia State
Salary           1148640.0
Name: R.J. Hunter, dtype: object

In [33]:
#Selecting Multiple Rows by Position
print(df.iloc[[3,5,7]])

                        Team  Number Position   Age Height  Weight  \
Name
R.J. Hunter   Boston Celtics    28.0       SG  22.0    6-5   185.0
Amir Johnson  Boston Celtics    90.0       PF  29.0    6-9   240.0
Kelly Olynyk  Boston Celtics    41.0        C  25.0    7-0   238.0

                    College      Salary
Name
R.J. Hunter   Georgia State   1148640.0
Amir Johnson            NaN  12000000.0
Kelly Olynyk        Gonzaga   2165160.0

In [34]:
#Selecting Specific Rows and Columns by Position
print(df.iloc[[2,4,6],[2,4,6]])

              Position Height            College
Name
John Holland        SG    6-5  Boston University
Jonas Jerebko       PF   6-10                NaN
Jordan Mickey       PF    6-8                LSU

In [36]:
#Selecting All Rows and Specific Columns by Position
df.iloc[:,[3,5,6]]

                Age  Weight            College
Name
Avery Bradley  25.0   180.0              Texas
Jae Crowder    25.0   235.0          Marquette
John Holland   27.0   205.0  Boston University
R.J. Hunter    22.0   185.0      Georgia State
Jonas Jerebko  29.0   231.0                NaN
...             ...     ...                ...
Shelvin Mack   26.0   203.0             Butler
Raul Neto      24.0   179.0                NaN
Tibor Pleiss   26.0   256.0                NaN
Jeff Withey    26.0   231.0             Kansas
NaN             NaN     NaN                NaN

[458 rows x 3 columns]

In [38]:
df.at['Jeff Withey','Age']

26.0

In [44]:
df.query(" Age>25  and Salary > 100000.0")

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
Isaiah Thomas,Boston Celtics,4.0,PG,27.0,5-9,185.0,Washington,6912869.0
Evan Turner,Boston Celtics,11.0,SG,27.0,6-7,220.0,Ohio State,3425510.0
Tyler Zeller,Boston Celtics,44.0,C,26.0,7-0,253.0,North Carolina,2616975.0
...,...,...,...,...,...,...,...,...
Joe Ingles,Utah Jazz,2.0,SF,28.0,6-8,226.0,NaN,2050000.0
Chris Johnson,Utah Jazz,23.0,SF,26.0,6-6,206.0,Dayton,981348.0
Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0

In [45]:
df[df['Age']>35]

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Elton Brand,Philadelphia 76ers,42.0,PF,37.0,6-9,254.0,Duke,NaN
Luis Scola,Toronto Raptors,4.0,PF,36.0,6-9,240.0,NaN,2900000.0
Jamal Crawford,Los Angeles Clippers,11.0,SG,36.0,6-5,195.0,Michigan,5675000.0
Paul Pierce,Los Angeles Clippers,34.0,SF,38.0,6-7,235.0,Kansas,3376000.0
Pablo Prigioni,Los Angeles Clippers,9.0,PG,39.0,6-3,185.0,NaN,947726.0
Kobe Bryant,Los Angeles Lakers,24.0,SF,37.0,6-6,212.0,NaN,25000000.0
Metta World Peace,Los Angeles Lakers,37.0,SF,36.0,6-7,260.0,St. John's,947276.0
Caron Butler,Sacramento Kings,31.0,SF,36.0,6-7,228.0,Connecticut,1449187.0
Steve Blake,Detroit Pistons,22.0,PG,36.0,6-3,172.0,Maryland,2170465.0
Dirk Nowitzki,Dallas Mavericks,41.0,PF,37.0,7-0,245.0,NaN,8333334.0
Jason Terry,Houston Rockets,31.0,SG,38.0,6-2,185.0,Arizona,947276.0
Chris Andersen,Memphis Grizzlies,7.0,PF,37.0,6-10,245.0,Blinn College,5000000.0
Matt Barnes,Memphis Grizzlies,22.0,SF,36.0,6-7,226.0,UCLA,3542500.0
Vince Carter,Memphis Grizzlies,15.0,SG,39.0,6-6,220.0,North Carolina,4088019.0
Matt Bonner,San Antonio Spurs,15.0,C,36.0,6-10,235.0,Florida,947276.0
Tim Duncan,San Antonio Spurs,21.0,C,40.0,6-11,250.0,Wake Forest,5250000.0
Manu Ginobili,San Antonio Spurs,20.0,SG,38.0,6-6,205.0,NaN,2814000.0
Andre Miller,San Antonio Spurs,24.0,PG,40.0,6-3,200.0,Utah,250750.0
Udonis Haslem,Miami Heat,40.0,PF,36.0,6-8,235.0,Florida,2854940.0
Mike Miller,Denver Nuggets,3.0,SG,36.0,6-8,218.0,Florida,947276.0
Kevin Garnett,Minnesota Timberwolves,21.0,PF,40.0,6-11,240.0,NaN,8500000.0
Tayshaun Prince,Minnesota Timberwolves,12.0,SF,36.0,6-9,212.0,Kentucky,947276.0
Nazr Mohammed,Oklahoma City Thunder,13.0,C,38.0,6-10,250.0,Kentucky,222888.0

In [57]:
df[df['Age']>35].iloc[:,[3,5]]

                    Age  Weight
Name
Elton Brand        37.0   254.0
Luis Scola         36.0   240.0
Jamal Crawford     36.0   195.0
Paul Pierce        38.0   235.0
Pablo Prigioni     39.0   185.0
Kobe Bryant        37.0   212.0
Metta World Peace  36.0   260.0
Caron Butler       36.0   228.0
Steve Blake        36.0   172.0
Dirk Nowitzki      37.0   245.0
Jason Terry        38.0   185.0
Chris Andersen     37.0   245.0
Matt Barnes        36.0   226.0
Vince Carter       39.0   220.0
Matt Bonner        36.0   235.0
Tim Duncan         40.0   250.0
Manu Ginobili      38.0   205.0
Andre Miller       40.0   200.0
Udonis Haslem      36.0   235.0
Mike Miller        36.0   218.0
Kevin Garnett      40.0   240.0
Tayshaun Prince    36.0   212.0
Nazr Mohammed      38.0   250.0

In [59]:
'''
Here we will get all rows having Salary greater or equal to 100000 and Age < 40 
and their JOB starts with â€˜Dâ€™ from the dataframe. **Print the details with Name and their JOB.** 
For the above requirement, we can achieve this by using loc. It is used to access single or
more rows and columns by label(s) or by a boolean array. loc works with column labels and indexes.

'''

'\nHere we will get all rows having Salary greater or equal to 100000 and Age < 40 \nand their JOB starts with â€˜Dâ€™ from the dataframe. **Print the details with Name and their JOB.** \nFor the above requirement, we can achieve this by using loc. It is used to access single or\nmore rows and columns by label(s) or by a boolean array. loc works with column labels and indexes.\n\n'

In [60]:
df = pd.DataFrame({'Name': [' RACHEL  ', ' MONICA  ', ' PHOEBE  ',
                                   '  ROSS    ', 'CHANDLER', ' JOEY    '],
                          
                          'Age': [30, 35, 37, 33, 34, 30],
                          
                          'Salary': [100000, 93000, 88000, 120000, 94000, 95000],
                          
                          'JOB': ['DESIGNER', 'CHEF', 'MASUS', 'PALENTOLOGY',
                                  'IT', 'ARTIST']})

In [61]:
df

         Name  Age  Salary          JOB
0    RACHEL     30  100000     DESIGNER
1    MONICA     35   93000         CHEF
2    PHOEBE     37   88000        MASUS
3    ROSS       33  120000  PALENTOLOGY
4    CHANDLER   34   94000           IT
5    JOEY       30   95000       ARTIST

In [68]:
result1=df.loc[(df['Salary']>=100000) & (df['Age']<40) & (df['JOB'].str.startswith('D')),['Name','JOB']]
result1

        Name       JOB
0   RACHEL    DESIGNER

In [76]:
df.query('Salary <= 100000 & Age <40 & JOB.str.startswith("C")')

        Name  Age  Salary   JOB
1   MONICA     35   93000  CHEF

In [78]:
#Concat with indexes changing
data1 = {'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'],
         'Age': [27, 24, 22, 32],
         'Address': ['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
         'Qualification': ['Msc', 'MA', 'MCA', 'Phd']}

data2 = {'Name': ['Abhi', 'Ayushi', 'Dhiraj', 'Hitesh'],
         'Age': [17, 14, 12, 52],
         'Address': ['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
         'Qualification': ['Btech', 'B.A', 'Bcom', 'B.hons']}
df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2)
df3=pd.concat([df1,df2])

In [79]:
df3

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannuaj           Phd
0    Abhi   17     Nagpur         Btech
1  Ayushi   14     Kanpur           B.A
2  Dhiraj   12  Allahabad          Bcom
3  Hitesh   52    Kannuaj        B.hons

In [81]:
df2=pd.DataFrame(data2,index=[4,5,6,7])
df3=pd.concat([df1,df2])
df3

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannuaj           Phd
4    Abhi   17     Nagpur         Btech
5  Ayushi   14     Kanpur           B.A
6  Dhiraj   12  Allahabad          Bcom
7  Hitesh   52    Kannuaj        B.hons

In [83]:
#------------------------

In [90]:
# Concatenating DataFrames by Setting Logic on Axes (Few rows are same)
data1 = {'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'],
         'Age': [27, 24, 22, 32],
         'Address': ['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
         'Qualification': ['Msc', 'MA', 'MCA', 'Phd'],
         'Mobile No': [97, 91, 58, 76]}

data2 = {'Name': ['Gaurav', 'Anuj', 'Dhiraj', 'Hitesh'],
         'Age': [22, 32, 12, 52],
         'Address': ['Allahabad', 'Kannuaj', 'Allahabad', 'Kannuaj'],
         'Qualification': ['MCA', 'Phd', 'Bcom', 'B.hons'],
         'Salary': [1000, 2000, 3000, 4000]}

df1=pd.DataFrame(data1,index=[0,1,2,3])
df2=pd.DataFrame(data2,index=[2,3,4,5])
df3=pd.concat([df1,df2],axis=1,join='inner')
df3

,Name,Age,Address,Qualification,Mobile No,Name,Age,Address,Qualification,Salary
2,Gaurav,22,Allahabad,MCA,58,Gaurav,22,Allahabad,MCA,1000
3,Anuj,32,Kannuaj,Phd,76,Anuj,32,Kannuaj,Phd,2000

In [96]:
df3=pd.concat([df1,df2],axis=1,sort=False)
df3

,Name,Age,Address,Qualification,Mobile No,Name,Age,Address,Qualification,Salary
0,Jai,27.0,Nagpur,Msc,97.0,NaN,NaN,NaN,NaN,NaN
1,Princi,24.0,Kanpur,MA,91.0,NaN,NaN,NaN,NaN,NaN
2,Gaurav,22.0,Allahabad,MCA,58.0,Gaurav,22.0,Allahabad,MCA,1000.0
3,Anuj,32.0,Kannuaj,Phd,76.0,Anuj,32.0,Kannuaj,Phd,2000.0
4,NaN,NaN,NaN,NaN,NaN,Dhiraj,12.0,Allahabad,Bcom,3000.0
5,NaN,NaN,NaN,NaN,NaN,Hitesh,52.0,Kannuaj,B.hons,4000.0

In [94]:
df3=pd.concat([df1,df2],ignore_index=True)
df3

     Name  Age    Address Qualification  Mobile No  Salary
0     Jai   27     Nagpur           Msc       97.0     NaN
1  Princi   24     Kanpur            MA       91.0     NaN
2  Gaurav   22  Allahabad           MCA       58.0     NaN
3    Anuj   32    Kannuaj           Phd       76.0     NaN
4  Gaurav   22  Allahabad           MCA        NaN  1000.0
5    Anuj   32    Kannuaj           Phd        NaN  2000.0
6  Dhiraj   12  Allahabad          Bcom        NaN  3000.0
7  Hitesh   52    Kannuaj        B.hons        NaN  4000.0

In [97]:
# Concatenating DataFrames by Setting Logic on Axes (Few rows are same)
data1 = {'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'],
         'Age': [27, 24, 22, 32],
         'Address': ['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
         'Qualification': ['Msc', 'MA', 'MCA', 'Phd'],
         'Mobile No': [97, 91, 58, 76]}

data2 = {'Name': ['Gaurav', 'Anuj', 'Dhiraj', 'Hitesh'],
         'Age': [22, 32, 12, 52],
         'Address': ['Allahabad', 'Kannuaj', 'Allahabad', 'Kannuaj'],
         'Qualification': ['MCA', 'Phd', 'Bcom', 'B.hons'],
         'Salary': [1000, 2000, 3000, 4000]}

df1=pd.DataFrame(data1,index=[0,1,2,3])
df2=pd.DataFrame(data2,index=[4,5,6,7])
df3=pd.concat([df1,df2],keys=['x','y'])
df3

       Name  Age    Address Qualification  Mobile No  Salary
x 0     Jai   27     Nagpur           Msc       97.0     NaN
  1  Princi   24     Kanpur            MA       91.0     NaN
  2  Gaurav   22  Allahabad           MCA       58.0     NaN
  3    Anuj   32    Kannuaj           Phd       76.0     NaN
y 4  Gaurav   22  Allahabad           MCA        NaN  1000.0
  5    Anuj   32    Kannuaj           Phd        NaN  2000.0
  6  Dhiraj   12  Allahabad          Bcom        NaN  3000.0
  7  Hitesh   52    Kannuaj        B.hons        NaN  4000.0

In [99]:
ser=pd.Series([120000,159080,453478,456666],name='Salary')
df4=pd.concat([df1,ser],axis=1)
df4

     Name  Age    Address Qualification  Mobile No  Salary
0     Jai   27     Nagpur           Msc         97  120000
1  Princi   24     Kanpur            MA         91  159080
2  Gaurav   22  Allahabad           MCA         58  453478
3    Anuj   32    Kannuaj           Phd         76  456666

In [101]:
#Merging DataFrames Using One Key
data1 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],}

data2 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']}

df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2)
print(df1)
print(df2)

  key    Name  Age
0  K0     Jai   27
1  K1  Princi   24
2  K2  Gaurav   22
3  K3    Anuj   32
  key    Address Qualification
0  K0     Nagpur         Btech
1  K1     Kanpur           B.A
2  K2  Allahabad          Bcom
3  K3    Kannuaj        B.hons

In [103]:
df3=pd.merge(df1,df2, on='key')
df3

  key    Name  Age    Address Qualification
0  K0     Jai   27     Nagpur         Btech
1  K1  Princi   24     Kanpur           B.A
2  K2  Gaurav   22  Allahabad          Bcom
3  K3    Anuj   32    Kannuaj        B.hons

In [104]:
#Merging DataFrames Using Multiple Keys
data1 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'key1': ['K0', 'K1', 'K0', 'K1'],
         'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],}

data2 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'key1': ['K0', 'K0', 'K0', 'K0'],
         'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']}
df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2)
print(df1)
print(df2)

  key key1    Name  Age
0  K0   K0     Jai   27
1  K1   K1  Princi   24
2  K2   K0  Gaurav   22
3  K3   K1    Anuj   32
  key key1    Address Qualification
0  K0   K0     Nagpur         Btech
1  K1   K0     Kanpur           B.A
2  K2   K0  Allahabad          Bcom
3  K3   K0    Kannuaj        B.hons

In [106]:
df3=pd.merge(df1,df2, on=['key','key1'])
df3

  key key1    Name  Age    Address Qualification
0  K0   K0     Jai   27     Nagpur         Btech
1  K2   K0  Gaurav   22  Allahabad          Bcom

In [107]:


data1 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'key1': ['K0', 'K1', 'K0', 'K1'],
         'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],}

data2 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'key1': ['K0', 'K0', 'K0', 'K0'],
         'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']}

df1 = pd.DataFrame(data1)

df2 = pd.DataFrame(data2)


print(df1, "\n\n", df2)

  key key1    Name  Age
0  K0   K0     Jai   27
1  K1   K1  Princi   24
2  K2   K0  Gaurav   22
3  K3   K1    Anuj   32

   key key1    Address Qualification
0  K0   K0     Nagpur         Btech
1  K1   K0     Kanpur           B.A
2  K2   K0  Allahabad          Bcom
3  K3   K0    Kannuaj        B.hons

In [108]:
df3=pd.merge(df1,df2,how='left',on=['key','key1'])
df3

  key key1    Name  Age    Address Qualification
0  K0   K0     Jai   27     Nagpur         Btech
1  K1   K1  Princi   24        NaN           NaN
2  K2   K0  Gaurav   22  Allahabad          Bcom
3  K3   K1    Anuj   32        NaN           NaN

In [109]:
df3=pd.merge(df1,df2,how='right',on=['key','key1'])
df3

  key key1    Name   Age    Address Qualification
0  K0   K0     Jai  27.0     Nagpur         Btech
1  K1   K0     NaN   NaN     Kanpur           B.A
2  K2   K0  Gaurav  22.0  Allahabad          Bcom
3  K3   K0     NaN   NaN    Kannuaj        B.hons

In [110]:
df3=pd.merge(df1,df2,how='outer',on=['key','key1'])
df3

  key key1    Name   Age    Address Qualification
0  K0   K0     Jai  27.0     Nagpur         Btech
1  K1   K0     NaN   NaN     Kanpur           B.A
2  K1   K1  Princi  24.0        NaN           NaN
3  K2   K0  Gaurav  22.0  Allahabad          Bcom
4  K3   K0     NaN   NaN    Kannuaj        B.hons
5  K3   K1    Anuj  32.0        NaN           NaN

In [111]:
df3=pd.merge(df1,df2,how='inner',on=['key','key1'])
df3

  key key1    Name  Age    Address Qualification
0  K0   K0     Jai   27     Nagpur         Btech
1  K2   K0  Gaurav   22  Allahabad          Bcom

In [112]:
#Joining DataFrames Using .join()
data1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32]}

data2 = {'Address':['Allahabad', 'Kannuaj', 'Allahabad', 'Kannuaj'],
        'Qualification':['MCA', 'Phd', 'Bcom', 'B.hons']}

df1 = pd.DataFrame(data1,index=['K0', 'K1', 'K2', 'K3'])

df2 = pd.DataFrame(data2, index=['K0', 'K2', 'K3', 'K4'])

df3=df1.join(df2)
df3

      Name  Age    Address Qualification
K0     Jai   27  Allahabad           MCA
K1  Princi   24        NaN           NaN
K2  Gaurav   22    Kannuaj           Phd
K3    Anuj   32  Allahabad          Bcom

In [114]:
#Now we use how = 'outer' in order to get union
df3=df1.join(df2,how='outer')
df3

      Name   Age    Address Qualification
K0     Jai  27.0  Allahabad           MCA
K1  Princi  24.0        NaN           NaN
K2  Gaurav  22.0    Kannuaj           Phd
K3    Anuj  32.0  Allahabad          Bcom
K4     NaN   NaN    Kannuaj        B.hons

In [116]:
#Joining DataFrames Using the "on" Argument
data1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Key':['K0', 'K1', 'K2', 'K3']}

data2 = {'Address':['Allahabad', 'Kannuaj', 'Allahabad', 'Kannuaj'],
        'Qualification':['MCA', 'Phd', 'Bcom', 'B.hons']}

df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2,index=['K0', 'K2', 'K3', 'K4'])
print(df1, "\n\n", df2)

     Name  Age Key
0     Jai   27  K0
1  Princi   24  K1
2  Gaurav   22  K2
3    Anuj   32  K3

       Address Qualification
K0  Allahabad           MCA
K2    Kannuaj           Phd
K3  Allahabad          Bcom
K4    Kannuaj        B.hons

In [117]:
df3=df1.join(df2,on='Key')
df3

     Name  Age Key    Address Qualification
0     Jai   27  K0  Allahabad           MCA
1  Princi   24  K1        NaN           NaN
2  Gaurav   22  K2    Kannuaj           Phd
3    Anuj   32  K3  Allahabad          Bcom

In [1]:
#Pandas sorting
import pandas as pd
import numpy as np

In [5]:
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [35, 30, 25, 40],
        'Score': [85, 90, 95, 80]}
df=pd.DataFrame(data)
sorted_df=df.sort_values(by='Age')
sorted_df

      Name  Age  Score
2  Charlie   25     95
1      Bob   30     90
0    Alice   35     85
3    David   40     80

In [7]:
sorted_df1=df.sort_values(by='Score', ascending=False)
sorted_df1

      Name  Age  Score
2  Charlie   25     95
1      Bob   30     90
0    Alice   35     85
3    David   40     80

In [9]:
sorted_df2=df.sort_values(by=['Age','Score'])
sorted_df2

      Name  Age  Score
2  Charlie   25     95
1      Bob   30     90
0    Alice   35     85
3    David   40     80

In [11]:
#Sorting DataFrame with Missing Values
data_with_nan = {"Name": ["Alice", "Bob", "Charlie", "David"],"Age": [28, 22, None, 22]}
df_nan = pd.DataFrame(data_with_nan)
sorted_df4=df_nan.sort_values(by='Age',na_position='first')
sorted_df4

      Name   Age
2  Charlie   NaN
1      Bob  22.0
3    David  22.0
0    Alice  28.0

In [13]:
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 40],
        'Score': [85, 90, 95, 80]}
df = pd.DataFrame(data)

df_sorted_by_index = df.sort_index()
print(df_sorted_by_index)

      Name  Age  Score
0    Alice   25     85
1      Bob   30     90
2  Charlie   35     95
3    David   40     80

In [15]:
df_sorted_by_index1 = df.sort_index(ascending=False)
df_sorted_by_index1

      Name  Age  Score
3    David   40     80
2  Charlie   35     95
1      Bob   30     90
0    Alice   25     85

In [17]:
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve"],
    "Age": [28, 22, 25, 22, 28],
    "Score": [85, 90, 95, 80, 88]
}
df = pd.DataFrame(data)
sort1=df.sort_values(by='Age',kind='quicksort')
sort1

      Name  Age  Score
1      Bob   22     90
3    David   22     80
2  Charlie   25     95
0    Alice   28     85
4      Eve   28     88

In [21]:
sort2=df.sort_values(by='Score',kind='mergesort')
sort2

      Name  Age  Score
3    David   22     80
0    Alice   28     85
4      Eve   28     88
1      Bob   22     90
2  Charlie   25     95

In [23]:
#Pandas Pivot Table
# creating dataframe
df = pd.DataFrame({'Product': ['Carrots', 'Broccoli', 'Banana', 'Banana',
                               'Beans', 'Orange', 'Broccoli', 'Banana'],
                   'Category': ['Vegetable', 'Vegetable', 'Fruit', 'Fruit',
                                'Vegetable', 'Fruit', 'Vegetable', 'Fruit'],
                   'Quantity': [8, 5, 3, 4, 5, 9, 11, 8],
                   'Amount': [270, 239, 617, 384, 626, 610, 62, 90]})
df

    Product   Category  Quantity  Amount
0   Carrots  Vegetable         8     270
1  Broccoli  Vegetable         5     239
2    Banana      Fruit         3     617
3    Banana      Fruit         4     384
4     Beans  Vegetable         5     626
5    Orange      Fruit         9     610
6  Broccoli  Vegetable        11      62
7    Banana      Fruit         8      90

In [25]:
df.pivot_table(index=['Product'],values=['Amount'],aggfunc='sum')

          Amount
Product
Banana      1091
Beans        626
Broccoli     301
Carrots      270
Orange       610

In [27]:
df.pivot_table(index=['Category'],values=['Amount'],aggfunc='sum')

           Amount
Category
Fruit        1701
Vegetable    1197

In [29]:
df.pivot_table(index=['Product','Category'],values=['Amount'],aggfunc='sum')

                    Amount
Product  Category
Banana   Fruit        1091
Beans    Vegetable     626
Broccoli Vegetable     301
Carrots  Vegetable     270
Orange   Fruit         610

In [31]:
df.pivot_table(index=['Product'],values=['Amount'],aggfunc={'mean','median','min','max'})

         Amount
            max        mean median  min
Product
Banana      617  363.666667  384.0   90
Beans       626  626.000000  626.0  626
Broccoli    239  150.500000  150.5   62
Carrots     270  270.000000  270.0  270
Orange      610  610.000000  610.0  610

In [1]:
#reading csv files
import pandas as pd
import numpy as np

In [69]:
df=pd.read_csv("Downloads/people_data.csv",index_col='First Name')
df.head(10)

,Last Name,Sex,Email,Date of birth,Job Title
First Name,,,,,
Shelby,Terrell,Male,elijah57@example.net,1945-10-26,Games developer
Phillip,Summers,Female,bethany14@example.com,1910-03-24,Phytotherapist
Kristine,Travis,Male,bthompson@example.com,1992-07-02,Homeopath
Yesenia,Martinez,Male,kaitlinkaiser@example.com,2017-08-03,Market researcher
Lori,Todd,Male,buchananmanuel@example.net,1938-12-01,Veterinary surgeon

In [ ]:
df=pd.read_csv('peoples_data.csv',na_values=['','N/A','Unknown'])
df

In [71]:
df

,Last Name,Sex,Email,Date of birth,Job Title
First Name,,,,,
Shelby,Terrell,Male,elijah57@example.net,1945-10-26,Games developer
Phillip,Summers,Female,bethany14@example.com,1910-03-24,Phytotherapist
Kristine,Travis,Male,bthompson@example.com,1992-07-02,Homeopath
Yesenia,Martinez,Male,kaitlinkaiser@example.com,2017-08-03,Market researcher
Lori,Todd,Male,buchananmanuel@example.net,1938-12-01,Veterinary surgeon

In [73]:
df.reset_index(inplace=True)

In [75]:
df

,First Name,Last Name,Sex,Email,Date of birth,Job Title
0,Shelby,Terrell,Male,elijah57@example.net,1945-10-26,Games developer
1,Phillip,Summers,Female,bethany14@example.com,1910-03-24,Phytotherapist
2,Kristine,Travis,Male,bthompson@example.com,1992-07-02,Homeopath
3,Yesenia,Martinez,Male,kaitlinkaiser@example.com,2017-08-03,Market researcher
4,Lori,Todd,Male,buchananmanuel@example.net,1938-12-01,Veterinary surgeon

In [47]:
print(df)

  First Name Last Name     Sex                       Email Date of birth  \
0     Shelby   Terrell    Male        elijah57@example.net    1945-10-26
1    Phillip   Summers  Female       bethany14@example.com    1910-03-24
2   Kristine    Travis    Male       bthompson@example.com    1992-07-02
3    Yesenia  Martinez    Male   kaitlinkaiser@example.com    2017-08-03
4       Lori      Todd    Male  buchananmanuel@example.net    1938-12-01

            Job Title
0     Games developer
1      Phytotherapist
2           Homeopath
3   Market researcher
4  Veterinary surgeon

In [77]:
ser=pd.DataFrame({'First Name':['Corry','Perma'],
               'Last Name':['Lam','Kerlis'],
               'Sex':['Female','Female'],
               'Email':['','permak@gmail.com'],
               'Date of birth':['1984-08-09','N/A'],
               'Job Title':['Unknown','CEO']})

In [79]:
df=pd.concat([df,ser],ignore_index=True)

In [81]:
df

,First Name,Last Name,Sex,Email,Date of birth,Job Title
0,Shelby,Terrell,Male,elijah57@example.net,1945-10-26,Games developer
1,Phillip,Summers,Female,bethany14@example.com,1910-03-24,Phytotherapist
2,Kristine,Travis,Male,bthompson@example.com,1992-07-02,Homeopath
3,Yesenia,Martinez,Male,kaitlinkaiser@example.com,2017-08-03,Market researcher
4,Lori,Todd,Male,buchananmanuel@example.net,1938-12-01,Veterinary surgeon
5,Corry,Lam,Female,,1984-08-09,Unknown
6,Perma,Kerlis,Female,permak@gmail.com,N/A,CEO

In [83]:
df=df.replace(['','N/A','Unknown'],np.nan)
df

,First Name,Last Name,Sex,Email,Date of birth,Job Title
0,Shelby,Terrell,Male,elijah57@example.net,1945-10-26,Games developer
1,Phillip,Summers,Female,bethany14@example.com,1910-03-24,Phytotherapist
2,Kristine,Travis,Male,bthompson@example.com,1992-07-02,Homeopath
3,Yesenia,Martinez,Male,kaitlinkaiser@example.com,2017-08-03,Market researcher
4,Lori,Todd,Male,buchananmanuel@example.net,1938-12-01,Veterinary surgeon
5,Corry,Lam,Female,NaN,1984-08-09,NaN
6,Perma,Kerlis,Female,permak@gmail.com,NaN,CEO

In [85]:
r=df

In [87]:
r

,First Name,Last Name,Sex,Email,Date of birth,Job Title
0,Shelby,Terrell,Male,elijah57@example.net,1945-10-26,Games developer
1,Phillip,Summers,Female,bethany14@example.com,1910-03-24,Phytotherapist
2,Kristine,Travis,Male,bthompson@example.com,1992-07-02,Homeopath
3,Yesenia,Martinez,Male,kaitlinkaiser@example.com,2017-08-03,Market researcher
4,Lori,Todd,Male,buchananmanuel@example.net,1938-12-01,Veterinary surgeon
5,Corry,Lam,Female,NaN,1984-08-09,NaN
6,Perma,Kerlis,Female,permak@gmail.com,NaN,CEO

In [99]:
r["Date of birth"] = pd.to_datetime(r["Date of birth"], errors="coerce")

In [101]:
r

0                                              1945-10-26 00:00:00
1                                              1910-03-24 00:00:00
2                                              1992-07-02 00:00:00
3                                              2017-08-03 00:00:00
4                                              1938-12-01 00:00:00
5                                              1984-08-09 00:00:00
6                                                              NaT
Date of birth    0   1945-10-26
1   1910-03-24
2   1992-07-02
3...
Name: Date of birth, dtype: object

In [109]:
df1=pd.read_csv("Downloads/people_data.csv",na_values=['','N/A','Unknown'],parse_dates=['Date of birth'])
df1

,First Name,Last Name,Sex,Email,Date of birth,Job Title
0,Shelby,Terrell,Male,elijah57@example.net,1945-10-26,Games developer
1,Phillip,Summers,Female,bethany14@example.com,1910-03-24,Phytotherapist
2,Kristine,Travis,Male,bthompson@example.com,1992-07-02,Homeopath
3,Yesenia,Martinez,Male,kaitlinkaiser@example.com,2017-08-03,Market researcher
4,Lori,Todd,Male,buchananmanuel@example.net,1938-12-01,Veterinary surgeon

In [115]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   First Name     7 non-null      object
 1   Last Name      7 non-null      object
 2   Sex            7 non-null      object
 3   Email          6 non-null      object
 4   Date of birth  6 non-null      object
 5   Job Title      6 non-null      object
dtypes: object(6)
memory usage: 468.0+ bytes

In [117]:
df.dtypes

First Name       object
Last Name        object
Sex              object
Email            object
Date of birth    object
Job Title        object
dtype: object

In [119]:
df['Date of birth'].dtype

dtype('O')

In [125]:
#detecting missing values

d = {'First Score': [100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score': [np.nan, 40, 80, 98]}
df=pd.DataFrame(d)
df

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         95.0           NaN         98.0

In [127]:
df.isnull()

   First Score  Second Score  Third Score
0        False         False         True
1        False         False        False
2         True         False        False
3        False          True        False

In [129]:
df.isna()

   First Score  Second Score  Third Score
0        False         False         True
1        False         False        False
2         True         False        False
3        False          True        False

In [133]:
df=pd.read_csv('Downloads/employees.csv')
df.head(10)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
5,Dennis,Male,4/18/1987,1:35 AM,115163,10.125,False,Legal
6,Ruby,Female,8/17/1987,4:20 PM,65476,10.012,True,Product
7,NaN,Female,7/20/2015,10:43 AM,45906,11.598,NaN,Finance
8,Angela,Female,11/22/2005,6:29 AM,95570,18.523,True,Engineering
9,Frances,Female,8/8/2002,6:51 AM,139852,7.524,True,Business Development

In [139]:
df[df['Gender'].isnull()]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
20,Lois,NaN,4/22/1995,7:18 PM,64714,4.934,True,Legal
22,Joshua,NaN,3/8/2012,1:58 AM,90816,18.816,True,Client Services
27,Scott,NaN,7/11/1991,6:58 PM,122367,5.218,False,Legal
31,Joyce,NaN,2/20/2005,2:40 PM,88657,12.752,False,Product
41,Christine,NaN,6/28/2015,1:08 AM,66582,11.308,True,Business Development
...,...,...,...,...,...,...,...,...
961,Antonio,NaN,6/18/1989,9:37 PM,103050,3.050,False,Legal
972,Victor,NaN,7/28/2006,2:49 PM,76381,11.159,True,Sales
985,Stephen,NaN,7/10/1983,8:10 PM,85668,1.909,False,Legal
989,Justin,NaN,2/10/1991,4:58 PM,38344,3.794,False,Legal
995,Henry,NaN,11/23/2014,6:09 AM,132483,16.655,False,Distribution

In [137]:
pd.isnull(df['Gender'])

0      False
1      False
2      False
3      False
4      False
       ...
995     True
996    False
997    False
998    False
999    False
Name: Gender, Length: 1000, dtype: bool

In [141]:
df['Gender'].isna()

0      False
1      False
2      False
3      False
4      False
       ...
995     True
996    False
997    False
998    False
999    False
Name: Gender, Length: 1000, dtype: bool

In [143]:
df[df['Gender'].isna()]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
20,Lois,NaN,4/22/1995,7:18 PM,64714,4.934,True,Legal
22,Joshua,NaN,3/8/2012,1:58 AM,90816,18.816,True,Client Services
27,Scott,NaN,7/11/1991,6:58 PM,122367,5.218,False,Legal
31,Joyce,NaN,2/20/2005,2:40 PM,88657,12.752,False,Product
41,Christine,NaN,6/28/2015,1:08 AM,66582,11.308,True,Business Development
...,...,...,...,...,...,...,...,...
961,Antonio,NaN,6/18/1989,9:37 PM,103050,3.050,False,Legal
972,Victor,NaN,7/28/2006,2:49 PM,76381,11.159,True,Sales
985,Stephen,NaN,7/10/1983,8:10 PM,85668,1.909,False,Legal
989,Justin,NaN,2/10/1991,4:58 PM,38344,3.794,False,Legal
995,Henry,NaN,11/23/2014,6:09 AM,132483,16.655,False,Distribution

In [147]:
df['Gender'].notnull()

0       True
1       True
2       True
3       True
4       True
       ...
995    False
996     True
997     True
998     True
999     True
Name: Gender, Length: 1000, dtype: bool

In [151]:
#notnull()
#isna()
#isnull()

In [153]:
#Filling Missing Values in Pandas
#fillna() used to replace missing values (NaN) with a given value
d = {'First Score': [100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score': [np.nan, 40, 80, 98]}
df = pd.DataFrame(d)
df

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         95.0           NaN         98.0

In [159]:
df.fillna(0,inplace=True)
df

   First Score  Second Score  Third Score
0        100.0          30.0          0.0
1         90.0          45.0         40.0
2          0.0          56.0         80.0
3         95.0           0.0         98.0

In [161]:
#Fill with Previous Value (Forward Fill)
df.fillna(method='pad')

C:\Users\Sreemayi Dontha\AppData\Local\Temp\ipykernel_3540\2483353496.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='pad')

   First Score  Second Score  Third Score
0        100.0          30.0          0.0
1         90.0          45.0         40.0
2          0.0          56.0         80.0
3         95.0           0.0         98.0

In [163]:
df=pd.read_csv('Downloads/employees.csv')
df.head(10)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
5,Dennis,Male,4/18/1987,1:35 AM,115163,10.125,False,Legal
6,Ruby,Female,8/17/1987,4:20 PM,65476,10.012,True,Product
7,NaN,Female,7/20/2015,10:43 AM,45906,11.598,NaN,Finance
8,Angela,Female,11/22/2005,6:29 AM,95570,18.523,True,Engineering
9,Frances,Female,8/8/2002,6:51 AM,139852,7.524,True,Business Development

In [165]:
df['Gender'].fillna('No Gender',inplace=True)

C:\Users\Sreemayi Dontha\AppData\Local\Temp\ipykernel_3540\2070073879.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Gender'].fillna('No Gender',inplace=True)

In [167]:
df

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,No Gender,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [169]:
df=pd.read_csv('Downloads/employees.csv')
df.head(10)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
5,Dennis,Male,4/18/1987,1:35 AM,115163,10.125,False,Legal
6,Ruby,Female,8/17/1987,4:20 PM,65476,10.012,True,Product
7,NaN,Female,7/20/2015,10:43 AM,45906,11.598,NaN,Finance
8,Angela,Female,11/22/2005,6:29 AM,95570,18.523,True,Engineering
9,Frances,Female,8/8/2002,6:51 AM,139852,7.524,True,Business Development

In [181]:
r=df.replace(np.nan,-99)
r

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,-99
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,-99,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [187]:
r[(r==-99).any(axis=1)]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,-99
7,-99,Female,7/20/2015,10:43 AM,45906,11.598,-99,Finance
10,Louise,Female,8/12/1980,9:01 AM,63241,15.132,True,-99
20,Lois,-99,4/22/1995,7:18 PM,64714,4.934,True,Legal
22,Joshua,-99,3/8/2012,1:58 AM,90816,18.816,True,Client Services
...,...,...,...,...,...,...,...,...
961,Antonio,-99,6/18/1989,9:37 PM,103050,3.050,False,Legal
972,Victor,-99,7/28/2006,2:49 PM,76381,11.159,True,Sales
985,Stephen,-99,7/10/1983,8:10 PM,85668,1.909,False,Legal
989,Justin,-99,2/10/1991,4:58 PM,38344,3.794,False,Legal
995,Henry,-99,11/23/2014,6:09 AM,132483,16.655,False,Distribution

In [193]:
#Dropping Missing Values in Pandas
dict = {'First Score': [100, 90, np.nan, 95],
        'Second Score': [30, np.nan, 45, 56],
        'Third Score': [52, 40, 80, 98],
        'Fourth Score': [np.nan, np.nan, np.nan, 65]}
df = pd.DataFrame(dict)
df

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0           52           NaN
1         90.0           NaN           40           NaN
2          NaN          45.0           80           NaN
3         95.0          56.0           98          65.0

In [191]:
#drop rows with atleast 1 missing value
df.dropna()

   First Score  Second Score  Third Score  Fourth Score
3         95.0          56.0           98          65.0

In [195]:
#Dropping Missing Values in Pandas
dict = {'First Score': [100, 90, np.nan, 95],
        'Second Score': [30, np.nan, 45, 56],
        'Third Score': [52, 40, 80, 98],
        'Fourth Score': [np.nan, np.nan, np.nan, 65]}
df = pd.DataFrame(dict)
df

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0           52           NaN
1         90.0           NaN           40           NaN
2          NaN          45.0           80           NaN
3         95.0          56.0           98          65.0

In [197]:
#dropping rows with all null values
df.dropna(how='all')

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0           52           NaN
1         90.0           NaN           40           NaN
2          NaN          45.0           80           NaN
3         95.0          56.0           98          65.0

In [199]:
#Dropping Columns with At Least One Null Value
dict = {'First Score': [100, np.nan, np.nan, 95],
        'Second Score': [30, np.nan, 45, 56],
        'Third Score': [52, np.nan, 80, 98],
        'Fourth Score': [60, 67, 68, 65]}
df = pd.DataFrame(dict)
df.dropna(axis=1)

   Fourth Score
0            60
1            67
2            68
3            65

In [203]:
import pandas as pd
d = pd.read_csv("Downloads/employees.csv")

nd = d.dropna(axis=0, how='any')

print("Old data frame length:", len(d))
print("New data frame length:", len(nd))
print("Rows with at least one missing value:", (len(d) - len(nd)))

Old data frame length: 1000
New data frame length: 764
Rows with at least one missing value: 236

In [207]:
#Pandas dataframe.drop_duplicates()
data = {
    "Name": ["Alice", "Bob", "Alice", "David"],
    "Age": [25, 30, 25, 40],
    "City": ["NY", "LA", "NY", "Chicago"]
}

df = pd.DataFrame(data)

print("Original DataFrame:")
print(df)
df_cleaned=df.drop_duplicates()
print(df_cleaned)

Original DataFrame:
    Name  Age     City
0  Alice   25       NY
1    Bob   30       LA
2  Alice   25       NY
3  David   40  Chicago
    Name  Age     City
0  Alice   25       NY
1    Bob   30       LA
3  David   40  Chicago

In [211]:
#DataFrame.drop_duplicates(subset=None, keep='first', inplace=False)
df.drop_duplicates(subset=['Name'])

    Name  Age     City
0  Alice   25       NY
1    Bob   30       LA
3  David   40  Chicago

In [213]:
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Alice', 'David'],
    'Age': [25, 30, 25, 40],
    'City': ['NY', 'LA', 'NY', 'Chicago']
})

df.drop_duplicates(keep='last')

    Name  Age     City
1    Bob   30       LA
2  Alice   25       NY
3  David   40  Chicago

In [215]:
df.drop_duplicates(keep='first')

    Name  Age     City
0  Alice   25       NY
1    Bob   30       LA
3  David   40  Chicago

In [217]:
df.drop_duplicates(keep=False)

    Name  Age     City
1    Bob   30       LA
3  David   40  Chicago

In [219]:
df_cleaned = df.drop_duplicates(subset=["Name", "City"])

In [221]:
df_cleaned

    Name  Age     City
0  Alice   25       NY
1    Bob   30       LA
3  David   40  Chicago

In [1]:
# FILE HANDLING IN PYTHON

In [132]:
with open("C:/Users/Sreemayi Dontha/OneDrive/Desktop/Plan/Python/file_info1.txt", "r")as file:
    content=file.read()
    print(content)

Python_project4.ipynb


Python_project4.ipynb


Homework 1:- Read Delta Format
Homework2:- Read about Delta Lake
Homework3:- Delta Live table advantages

Reading and writing python files


IF NOT EXISTS (SELECT * FROM sys.external_file_formats WHERE name ='csv_file_format')
  CREATE EXTERNAL FILE FORMAT csv_file_format
  WITH (
      FORMAT_TYPE = DELIMITEDTEXT,
      FORMAT_OPTIONS (
        FIELD_TERMINATOR = ','
      , STRING_DELIMITER = '"'
      , First_Row = 2
      , USE_TYPE_DEFAULT = FALSE
      , Encoding = 'UTF8'
      , PARSER_VERSION = '2.0' )
      );


IF NOT EXISTS (SELECT * FROM sys.external_file_formats WHERE name ='csv_file_format_pv1')
  CREATE EXTERNAL FILE FORMAT csv_file_format_pv1
  WITH (
      FORMAT_TYPE = DELIMITEDTEXT,
      FORMAT_OPTIONS (
        FIELD_TERMINATOR = ','
      , STRING_DELIMITER = '"'
      , First_Row = 2
      , USE_TYPE_DEFAULT = FALSE
      , Encoding = 'UTF8'
      , PARSER_VERSION = '1.0' )
      );


----------------------------------------------------

In [27]:
import os
print(os.getcwd())

C:\Users\Sreemayi Dontha\Python_Only

In [31]:
print(file.name)
print(file.mode)
print(file.closed)

C:/Users/Sreemayi Dontha/OneDrive/Desktop/Plan/Python/file_info1.txt
r
True

In [130]:
file=open("C:/Users/Sreemayi Dontha/OneDrive/Desktop/Plan/Python/file_info1.txt", "r")
for line in file:
    print(line.strip())
file.close()

Python_project4.ipynb


Python_project4.ipynb


Homework 1:- Read Delta Format
Homework2:- Read about Delta Lake
Homework3:- Delta Live table advantages

Reading and writing python files


IF NOT EXISTS (SELECT * FROM sys.external_file_formats WHERE name ='csv_file_format')
CREATE EXTERNAL FILE FORMAT csv_file_format
WITH (
FORMAT_TYPE = DELIMITEDTEXT,
FORMAT_OPTIONS (
FIELD_TERMINATOR = ','
, STRING_DELIMITER = '"'
, First_Row = 2
, USE_TYPE_DEFAULT = FALSE
, Encoding = 'UTF8'
, PARSER_VERSION = '2.0' )
);


IF NOT EXISTS (SELECT * FROM sys.external_file_formats WHERE name ='csv_file_format_pv1')
CREATE EXTERNAL FILE FORMAT csv_file_format_pv1
WITH (
FORMAT_TYPE = DELIMITEDTEXT,
FORMAT_OPTIONS (
FIELD_TERMINATOR = ','
, STRING_DELIMITER = '"'
, First_Row = 2
, USE_TYPE_DEFAULT = FALSE
, Encoding = 'UTF8'
, PARSER_VERSION = '1.0' )
);


----------------------------------------------------

In [35]:
file.closed

True

In [134]:
file1=open("C:/Users/Sreemayi Dontha/OneDrive/Desktop/Plan/Python/file_info1.txt", "r")
line=file1.readline()
while line:
    print(line.strip())
    line=file1.readline()
file1.close()

Python_project4.ipynb


Python_project4.ipynb


Homework 1:- Read Delta Format
Homework2:- Read about Delta Lake
Homework3:- Delta Live table advantages

Reading and writing python files


IF NOT EXISTS (SELECT * FROM sys.external_file_formats WHERE name ='csv_file_format')
CREATE EXTERNAL FILE FORMAT csv_file_format
WITH (
FORMAT_TYPE = DELIMITEDTEXT,
FORMAT_OPTIONS (
FIELD_TERMINATOR = ','
, STRING_DELIMITER = '"'
, First_Row = 2
, USE_TYPE_DEFAULT = FALSE
, Encoding = 'UTF8'
, PARSER_VERSION = '2.0' )
);


IF NOT EXISTS (SELECT * FROM sys.external_file_formats WHERE name ='csv_file_format_pv1')
CREATE EXTERNAL FILE FORMAT csv_file_format_pv1
WITH (
FORMAT_TYPE = DELIMITEDTEXT,
FORMAT_OPTIONS (
FIELD_TERMINATOR = ','
, STRING_DELIMITER = '"'
, First_Row = 2
, USE_TYPE_DEFAULT = FALSE
, Encoding = 'UTF8'
, PARSER_VERSION = '1.0' )
);


----------------------------------------------------

In [136]:
with open("C:/Users/Sreemayi Dontha/OneDrive/Desktop/Plan/Python/file_info1.txt", "r") as file:
    content=file.read(100)
    print(content.strip())
file.close()

Python_project4.ipynb


Python_project4.ipynb


Homework 1:- Read Delta Format
Homework2:- Read abou

In [51]:
import csv
import io

csv_data="""Year,Industry,Value
2014,Manufacturing,769400
2014,Manufacturing,48000
2014,Manufacturing,12 """

csv_read=csv.reader(io.StringIO(csv_data))
print(csv_read)
for i in csv_read:
    print(i)

<_csv.reader object at 0x0000017D66501CC0>
['Year', 'Industry', 'Value']
['2014', 'Manufacturing', '769400']
['2014', 'Manufacturing', '48000']
['2014', 'Manufacturing', '12 ']

In [59]:
import json
with open("C:/Users/Sreemayi Dontha/Downloads/payment_type.json","r") as jsonfile:
    data=json.load(jsonfile)
    print(data)

[{'payment_type': 1, 'payment_type_desc': 'Credit card'}, {'payment_type': 2, 'payment_type_desc': 'Cash'}, {'payment_type': 3, 'payment_type_desc': 'No charge'}, {'payment_type': 4, 'payment_type_desc': 'Dispute'}, {'payment_type': 5, 'payment_type_desc': 'Unknown'}, {'payment_type': 6, 'payment_type_desc': 'Voided trip'}]

In [89]:
with open("C:/Users/Sreemayi Dontha/OneDrive/Desktop/Plan/Python/file_info3.txt","a") as wfile:
    wfile.write("Start writing into the file\n")
    wfile.write("writing the csv")
print("written successfully to the file")

written successfully to the file

In [95]:
try:
    file=open("C:/Users/Sreemayi Dontha/OneDrive/Desktop/Plan/Python/file_info3.txt","r")
    content=file.read()
    print(content)
finally:
    file.close()

Start writing into the file
writing the csvStart writing into the file
writing the csv

In [101]:
try :
    with open("C:/Users/Sreemayi Dontha/OneDrive/Desktop/Plan/Python/file_info3.txt","x") as f:
        f.write("Creating and writing to the exclusive file\n")
except FileExistsError:
    print("file.txt already exists, exclusive creation aborted.")

file.txt already exists, exclusive creation aborted.

In [103]:
lines = ["First line\n", "Second line\n", "Third line\n"]
with open("C:/Users/Sreemayi Dontha/OneDrive/Desktop/Plan/Python/file_info3.txt","a") as f:
    f.writelines(lines)

with open("C:/Users/Sreemayi Dontha/OneDrive/Desktop/Plan/Python/file_info3.txt","r") as f:
    content=f.read()
    print(content)

Start writing into the file
writing the csvStart writing into the file
writing the csvFirst line
Second line
Third line

In [109]:
with open("C:/Users/Sreemayi Dontha/OneDrive/Desktop/Plan/Python/file_info2.txt","r+") as f:
    print(f.read())
    f.seek(0)
    f.write("Hi")
    f.seek(0)
    print(f.read())

Hiart writing into the file
writing the csv
Hiart writing into the file
writing the csv

In [113]:
with open("C:/Users/Sreemayi Dontha/OneDrive/Desktop/Plan/Python/file_info2.txt","r+") as f:
    
    f.seek(0,2)
    f.write("\n New Line")
    f.seek(0)
    print(f.read())

Hiart writing into the file
writing the csv
 New Line
 New Line

In [118]:
# w+ Mode (Write + Read + Truncate)
with open("C:/Users/Sreemayi Dontha/OneDrive/Desktop/Plan/Python/file_info2.txt","w+") as f:
    f.write("New content")  
    f.seek(0)
    print(f.read())

New content

In [122]:
import shutil
shutil.copy("C:/Users/Sreemayi Dontha/OneDrive/Desktop/Plan/Python/file_info1.txt","C:/Users/Sreemayi Dontha/OneDrive/Desktop/Plan/Python/file_info2.txt")

'C:/Users/Sreemayi Dontha/OneDrive/Desktop/Plan/Python/file_info2.txt'

In [126]:
with open("C:/Users/Sreemayi Dontha/OneDrive/Desktop/Plan/Python/file_info2.txt","r") as f:
    print(f.read())

Python_project4.ipynb


Python_project4.ipynb


Homework 1:- Read Delta Format
Homework2:- Read about Delta Lake
Homework3:- Delta Live table advantages

Reading and writing python files


IF NOT EXISTS (SELECT * FROM sys.external_file_formats WHERE name ='csv_file_format')
  CREATE EXTERNAL FILE FORMAT csv_file_format
  WITH (
      FORMAT_TYPE = DELIMITEDTEXT,
      FORMAT_OPTIONS (
        FIELD_TERMINATOR = ','
      , STRING_DELIMITER = '"'
      , First_Row = 2
      , USE_TYPE_DEFAULT = FALSE
      , Encoding = 'UTF8'
      , PARSER_VERSION = '2.0' )
      );


IF NOT EXISTS (SELECT * FROM sys.external_file_formats WHERE name ='csv_file_format_pv1')
  CREATE EXTERNAL FILE FORMAT csv_file_format_pv1
  WITH (
      FORMAT_TYPE = DELIMITEDTEXT,
      FORMAT_OPTIONS (
        FIELD_TERMINATOR = ','
      , STRING_DELIMITER = '"'
      , First_Row = 2
      , USE_TYPE_DEFAULT = FALSE
      , Encoding = 'UTF8'
      , PARSER_VERSION = '1.0' )
      );


----------------------------------------------------

In [128]:
with open("C:/Users/Sreemayi Dontha/OneDrive/Desktop/Plan/Python/file_info1.txt","r") as f:
    print(f.read())

Python_project4.ipynb


Python_project4.ipynb


Homework 1:- Read Delta Format
Homework2:- Read about Delta Lake
Homework3:- Delta Live table advantages

Reading and writing python files


IF NOT EXISTS (SELECT * FROM sys.external_file_formats WHERE name ='csv_file_format')
  CREATE EXTERNAL FILE FORMAT csv_file_format
  WITH (
      FORMAT_TYPE = DELIMITEDTEXT,
      FORMAT_OPTIONS (
        FIELD_TERMINATOR = ','
      , STRING_DELIMITER = '"'
      , First_Row = 2
      , USE_TYPE_DEFAULT = FALSE
      , Encoding = 'UTF8'
      , PARSER_VERSION = '2.0' )
      );


IF NOT EXISTS (SELECT * FROM sys.external_file_formats WHERE name ='csv_file_format_pv1')
  CREATE EXTERNAL FILE FORMAT csv_file_format_pv1
  WITH (
      FORMAT_TYPE = DELIMITEDTEXT,
      FORMAT_OPTIONS (
        FIELD_TERMINATOR = ','
      , STRING_DELIMITER = '"'
      , First_Row = 2
      , USE_TYPE_DEFAULT = FALSE
      , Encoding = 'UTF8'
      , PARSER_VERSION = '1.0' )
      );


----------------------------------------------------

In [11]:
#Exception handling
try:
    a='1'/200
except TypeError :
    print("TypeError")
except ZeroDivisionError:
    print("Zero has no inverse!")    
else:
    print("Result is", a)    
finally:
    print("Exception handled")

TypeError
Exception handled

In [13]:
#Exception handling
try:
    a='1'/200
except (TypeError,ValueError) as e :
    print(e)
 
else:
    print("Result is", a)    
finally:
    print("Exception handled")

unsupported operand type(s) for /: 'str' and 'int'
Exception handled

In [15]:
# raise Exception
def set(age):
    if age<0:
        raise ValueError("Age cannot be negative.")
    print(f"The given age is{age}")

try :
    set(-9)

except ValueError as e:
    print(e)
finally:
    print("Exception handled")

Age cannot be negative.
Exception handled

In [17]:
#Pandas Change Datatype

In [19]:
import pandas as pd
import numpy as np

data = {'Name': ['John', 'Alice', 'Bob', 'Eve', 'Charlie'], 
        'Age': [25, 30, 22, 35, 28], 
        'Gender': ['Male', 'Female', 'Male', 'Female', 'Male'], 
        'Salary': [50000, 55000, 40000, 70000, 48000]}

df = pd.DataFrame(data)

In [21]:
df['Age']=df['Age'].astype(float)

In [23]:
df

      Name   Age  Gender  Salary
0     John  25.0    Male   50000
1    Alice  30.0  Female   55000
2      Bob  22.0    Male   40000
3      Eve  35.0  Female   70000
4  Charlie  28.0    Male   48000

In [25]:
df['Join Date'] = ['2021-01-01', '2020-05-22', '2022-03-15', '2021-07-30', '2020-11-11']

In [27]:
df

      Name   Age  Gender  Salary   Join Date
0     John  25.0    Male   50000  2021-01-01
1    Alice  30.0  Female   55000  2020-05-22
2      Bob  22.0    Male   40000  2022-03-15
3      Eve  35.0  Female   70000  2021-07-30
4  Charlie  28.0    Male   48000  2020-11-11

In [29]:
df['Join Date']=pd.to_datetime(df['Join Date'])

In [31]:
df

      Name   Age  Gender  Salary  Join Date
0     John  25.0    Male   50000 2021-01-01
1    Alice  30.0  Female   55000 2020-05-22
2      Bob  22.0    Male   40000 2022-03-15
3      Eve  35.0  Female   70000 2021-07-30
4  Charlie  28.0    Male   48000 2020-11-11

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Name       5 non-null      object
 1   Age        5 non-null      float64
 2   Gender     5 non-null      object
 3   Salary     5 non-null      int64
 4   Join Date  5 non-null      datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(1), object(2)
memory usage: 332.0+ bytes

In [37]:
#Changing Multiple Columns' Data Types
df=df.astype({'Age':float,'Salary': str})

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Name       5 non-null      object
 1   Age        5 non-null      float64
 2   Gender     5 non-null      object
 3   Salary     5 non-null      object
 4   Join Date  5 non-null      datetime64[ns]
dtypes: datetime64[ns](1), float64(1), object(3)
memory usage: 332.0+ bytes

In [41]:
df.dtypes

Name                 object
Age                 float64
Gender               object
Salary               object
Join Date    datetime64[ns]
dtype: object

In [43]:
# Drop Empty Columns in Pandas
df = pd.DataFrame({'FirstName': ['Vipul', 'Ashish', 'Milan'],
                            "Gender": ["", "", ""],
                            "Age": [0, 0, 0]})
df['Department'] = np.nan
display(df)

  FirstName Gender  Age  Department
0     Vipul           0         NaN
1    Ashish           0         NaN
2     Milan           0         NaN

In [47]:
df.dropna(how='all',axis=1,inplace=True)

In [49]:
df

  FirstName Gender  Age
0     Vipul           0
1    Ashish           0
2     Milan           0

In [51]:
df.replace([0,""],np.nan,inplace=True)

C:\Users\Sreemayi Dontha\AppData\Local\Temp\ipykernel_25608\1759579438.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df.replace([0,""],np.nan,inplace=True)

In [53]:
df

  FirstName  Gender  Age
0     Vipul     NaN  NaN
1    Ashish     NaN  NaN
2     Milan     NaN  NaN

In [55]:
df.dropna(how='all',axis=1,inplace=True)

In [57]:
df

  FirstName
0     Vipul
1    Ashish
2     Milan

In [59]:
# String manipulations in Pandas DataFrame

In [61]:
data = {'Names': ['Gulshan', 'Shashank', 'Bablu', 'Abhishek', 'Anand', np.nan, 'Pratap'],
        'City': ['Delhi', 'Mumbai', 'Kolkata', 'Delhi', 'Chennai', 'Bangalore', 'Hyderabad']}

df = pd.DataFrame(data)
display(df)

      Names       City
0   Gulshan      Delhi
1  Shashank     Mumbai
2     Bablu    Kolkata
3  Abhishek      Delhi
4     Anand    Chennai
5       NaN  Bangalore
6    Pratap  Hyderabad

In [63]:
df.astype('string')

      Names       City
0   Gulshan      Delhi
1  Shashank     Mumbai
2     Bablu    Kolkata
3  Abhishek      Delhi
4     Anand    Chennai
5      <NA>  Bangalore
6    Pratap  Hyderabad

In [67]:
df['Names'].str.lower()

0     gulshan
1    shashank
2       bablu
3    abhishek
4       anand
5         NaN
6      pratap
Name: Names, dtype: object

In [69]:
df['Names'].str.upper()

0     GULSHAN
1    SHASHANK
2       BABLU
3    ABHISHEK
4       ANAND
5         NaN
6      PRATAP
Name: Names, dtype: object

In [73]:
# strip is to trip from both sides
df['Names'].str.strip()

0     Gulshan
1    Shashank
2       Bablu
3    Abhishek
4       Anand
5         NaN
6      Pratap
Name: Names, dtype: object

In [75]:
df['Names'].str.len()

0    7.0
1    8.0
2    5.0
3    8.0
4    5.0
5    NaN
6    6.0
Name: Names, dtype: float64

In [77]:
df['Names'].str.startswith('G')

0     True
1    False
2    False
3    False
4    False
5      NaN
6    False
Name: Names, dtype: object

In [79]:
df['Names'].str.endswith('h')

0    False
1    False
2    False
3    False
4    False
5      NaN
6    False
Name: Names, dtype: object

In [89]:
df['Names'].str.replace('Bablu','Bunny')

0     Gulshan
1    Shashank
2       Bunny
3    Abhishek
4       Anand
5         NaN
6      Pratap
Name: Names, dtype: object

In [83]:
df

      Names       City
0   Gulshan      Delhi
1  Shashank     Mumbai
2     Bablu    Kolkata
3  Abhishek      Delhi
4     Anand    Chennai
5       NaN  Bangalore
6    Pratap  Hyderabad

In [91]:
# print(df['Names'].str.swapcase())
# print(df['Names'].str.isnumeric())
# print(df['Names'].str.isupper())
# print(df['Names'].str.islower())
# print(df['Names'].str.findall('a'))
# print(df['Names'].str.find('a'))
# print(df['Names'].str.count('a'))

In [97]:
df.describe()

          Names   City
count         6      7
unique        6      6
top     Gulshan  Delhi
freq          1      2

In [43]:
import pandas as pd
import numpy as np

data = {'Name': ['John', 'Alice', 'Bob', 'Eve', 'Charlie'], 
        'Age': [25, 30, np.nan, 35, 28], 
        'Gender': ['', 'Female', 'Male', 'Female', 'Male'], 
        'Salary': [50000, 55000, 40000, np.nan, 48000],
       'Married':['Yes','No','',np.nan,'Np']}

df = pd.DataFrame(data)

In [45]:
df

      Name   Age  Gender   Salary Married
0     John  25.0          50000.0     Yes
1    Alice  30.0  Female  55000.0      No
2      Bob   NaN    Male  40000.0
3      Eve  35.0  Female      NaN     NaN
4  Charlie  28.0    Male  48000.0      Np

In [29]:
df.columns

Index(['Name', 'Age', 'Gender', 'Salary', 'Married'], dtype='object')

In [31]:
df.describe()

             Age        Salary
count   4.000000      4.000000
mean   29.500000  48250.000000
std     4.203173   6238.322424
min    25.000000  40000.000000
25%    27.250000  46000.000000
50%    29.000000  49000.000000
75%    31.250000  51250.000000
max    35.000000  55000.000000

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     5 non-null      object
 1   Age      4 non-null      float64
 2   Gender   5 non-null      object
 3   Salary   4 non-null      float64
 4   Married  4 non-null      object
dtypes: float64(2), object(3)
memory usage: 332.0+ bytes

In [35]:
df.isnull()

    Name    Age  Gender  Salary  Married
0  False  False   False   False    False
1  False  False   False   False    False
2  False   True   False   False    False
3  False  False   False    True     True
4  False  False   False   False    False

In [17]:
df[df['Age'].isnull()]

  Name  Age Gender   Salary Married
2  Bob  NaN   Male  40000.0

In [19]:
df.isnull().sum()

Name       0
Age        1
Gender     0
Salary     1
Married    1
dtype: int64

In [37]:
df.replace("",np.nan,inplace=True)

In [39]:
df.isnull().sum()

Name       0
Age        1
Gender     1
Salary     1
Married    2
dtype: int64

In [41]:
df

      Name   Age  Gender   Salary Married
0     John  25.0     NaN  50000.0     Yes
1    Alice  30.0  Female  55000.0      No
2      Bob   NaN    Male  40000.0     NaN
3      Eve  35.0  Female      NaN     NaN
4  Charlie  28.0    Male  48000.0      Np

In [47]:
df.fillna(-99,inplace=True) # fills only np.nan or Nulls but not empty strings

In [49]:
df

      Name   Age  Gender   Salary Married
0     John  25.0          50000.0     Yes
1    Alice  30.0  Female  55000.0      No
2      Bob -99.0    Male  40000.0
3      Eve  35.0  Female    -99.0     -99
4  Charlie  28.0    Male  48000.0      Np

In [55]:
df.drop(2).head()

      Name   Age  Gender   Salary Married
0     John  25.0          50000.0     Yes
1    Alice  30.0  Female  55000.0      No
3      Eve  35.0  Female    -99.0     -99
4  Charlie  28.0    Male  48000.0      Np

In [53]:
df

      Name   Age  Gender   Salary Married
0     John  25.0          50000.0     Yes
1    Alice  30.0  Female  55000.0      No
2      Bob -99.0    Male  40000.0
3      Eve  35.0  Female    -99.0     -99
4  Charlie  28.0    Male  48000.0      Np

In [57]:
df.sort_values(by='Age', ascending=False)

      Name   Age  Gender   Salary Married
3      Eve  35.0  Female    -99.0     -99
1    Alice  30.0  Female  55000.0      No
4  Charlie  28.0    Male  48000.0      Np
0     John  25.0          50000.0     Yes
2      Bob -99.0    Male  40000.0

In [59]:
df.sort_values(by=['Age','Salary'], ascending=False)

      Name   Age  Gender   Salary Married
3      Eve  35.0  Female    -99.0     -99
1    Alice  30.0  Female  55000.0      No
4  Charlie  28.0    Male  48000.0      Np
0     John  25.0          50000.0     Yes
2      Bob -99.0    Male  40000.0

In [61]:
#Creating dataframe1
df1 = pd.DataFrame({
        'Name':['Jeevan', 'Raavan', 'Geeta', 'Bheem'], 
        'Age':[25, 24, 52, 40], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']})
df1

     Name  Age Qualification
0  Jeevan   25           Msc
1  Raavan   24            MA
2   Geeta   52           MCA
3   Bheem   40           Phd

In [63]:
#Creating dataframe2
df2 = pd.DataFrame({'Name':['Jeevan', 'Raavan', 'Geeta', 'Bheem'],
                    'Salary':[100000, 50000, 20000, 40000]})
df2

     Name  Salary
0  Jeevan  100000
1  Raavan   50000
2   Geeta   20000
3   Bheem   40000

In [65]:
pd.merge(df1,df2, on='Name')

     Name  Age Qualification  Salary
0  Jeevan   25           Msc  100000
1  Raavan   24            MA   50000
2   Geeta   52           MCA   20000
3   Bheem   40           Phd   40000

In [67]:
# creating a dataframe object
student_register = pd.DataFrame()

# assigning values to the 
# rows and columns of the dataframe
student_register['Name'] = ['Abhijit','Smriti',
                            'Akash', 'Roshni']
student_register['Age'] = [20, 19, 20, 14]
student_register['Student'] = [False, True,
                               True, False]

print(student_register)

      Name  Age  Student
0  Abhijit   20    False
1   Smriti   19     True
2    Akash   20     True
3   Roshni   14    False

In [73]:
# Adding new row
d1=pd.Series(['Bunny',25,True],index=['Name','Age','Student'])
d1

Name       Bunny
Age           25
Student     True
dtype: object

In [85]:
pd.concat([student_register,d1.to_frame().T],ignore_index=True) # adding new row

      Name Age Student
0  Abhijit  20   False
1   Smriti  19    True
2    Akash  20    True
3   Roshni  14   False
4    Bunny  25    True

In [89]:
student_register.loc[len(student_register)]=['Munny',27,False] #addling new row

In [91]:
student_register

      Name  Age  Student
0  Abhijit   20    False
1   Smriti   19     True
2    Akash   20     True
3   Roshni   14    False
4    Munny   27    False

In [93]:
student_register.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     5 non-null      object
 1   Age      5 non-null      int64
 2   Student  5 non-null      bool
dtypes: bool(1), int64(1), object(1)
memory usage: 125.0+ bytes

In [95]:
student_register.describe()

             Age
count   5.000000
mean   20.000000
std     4.636809
min    14.000000
25%    19.000000
50%    20.000000
75%    20.000000
max    27.000000

In [99]:
student_register.shape

(5, 3)

In [113]:
student_register.corr(numeric_only=True) # finding correlation

              Age   Student
Age      1.000000 -0.098437
Student -0.098437  1.000000

In [117]:
student_register.drop('Age',axis=1)

      Name  Student
0  Abhijit    False
1   Smriti     True
2    Akash     True
3   Roshni    False
4    Munny    False

In [119]:
student_register

      Name  Age  Student
0  Abhijit   20    False
1   Smriti   19     True
2    Akash   20     True
3   Roshni   14    False
4    Munny   27    False

In [121]:
student_register.drop(3)

      Name  Age  Student
0  Abhijit   20    False
1   Smriti   19     True
2    Akash   20     True
4    Munny   27    False

In [123]:
#sql <---> Python

In [125]:
import pandas as pd

df = pd.DataFrame({
    "employee_id": [1,2,3,4,5,6,7,8],
    "employee": ["A","B","C","D","E","F","G","H"],
    "department": ["IT","HR","IT","HR","IT","Sales","Sales","IT"],
    "salary": [100, 80, 120, 90, 130, 150, 140, 110],
    "bonus": [10, 5, 12, 7, 15, 20, 18, 10]
})
df

   employee_id employee department  salary  bonus
0            1        A         IT     100     10
1            2        B         HR      80      5
2            3        C         IT     120     12
3            4        D         HR      90      7
4            5        E         IT     130     15
5            6        F      Sales     150     20
6            7        G      Sales     140     18
7            8        H         IT     110     10

In [127]:
# Total employees per department
df.groupby('department')['employee_id'].count()

department
HR       2
IT       4
Sales    2
Name: employee_id, dtype: int64

In [131]:
#Average salary per department
# ------  select department, avg(salary) from employee group by department
df.groupby('department')['salary'].mean()

department
HR        85.0
IT       115.0
Sales    145.0
Name: salary, dtype: float64

In [135]:
# Departments with more than 2 employees (HAVING)
df.groupby('department').filter(lambda x : len(x) >2 )

   employee_id employee department  salary  bonus
0            1        A         IT     100     10
2            3        C         IT     120     12
4            5        E         IT     130     15
7            8        H         IT     110     10

In [145]:
#  Add each department's average salary to each row (window function)
df['avg_dept']=df.groupby('department')['salary'].transform("mean")

In [147]:
df

   employee_id employee department  salary  bonus  avg_dept
0            1        A         IT     100     10     115.0
1            2        B         HR      80      5      85.0
2            3        C         IT     120     12     115.0
3            4        D         HR      90      7      85.0
4            5        E         IT     130     15     115.0
5            6        F      Sales     150     20     145.0
6            7        G      Sales     140     18     145.0
7            8        H         IT     110     10     115.0

In [149]:
#  Highest salary in each department
df.groupby('department')['salary'].max()

department
HR        90
IT       130
Sales    150
Name: salary, dtype: int64

In [151]:
# Total salary + bonus per department
'''
SELECT department,
       SUM(salary) AS total_salary,
       SUM(bonus) AS total_bonus
FROM employees
GROUP BY department;

'''
df.groupby('department').agg(
    total_salary=('salary','sum'),
    total_bonus=('bonus','sum')
)

            total_salary  total_bonus
department
HR                   170           12
IT                   460           47
Sales                290           38

In [153]:
# Find employees whose salary is above their departmentâ€™s average
df["dept_avg"]=df.groupby('department')['salary'].transform("mean")

In [155]:
df

   employee_id employee department  salary  bonus  avg_dept  dept_avg
0            1        A         IT     100     10     115.0     115.0
1            2        B         HR      80      5      85.0      85.0
2            3        C         IT     120     12     115.0     115.0
3            4        D         HR      90      7      85.0      85.0
4            5        E         IT     130     15     115.0     115.0
5            6        F      Sales     150     20     145.0     145.0
6            7        G      Sales     140     18     145.0     145.0
7            8        H         IT     110     10     115.0     115.0

In [157]:
df[df['salary']>df['dept_avg']]

   employee_id employee department  salary  bonus  avg_dept  dept_avg
2            3        C         IT     120     12     115.0     115.0
3            4        D         HR      90      7      85.0      85.0
4            5        E         IT     130     15     115.0     115.0
5            6        F      Sales     150     20     145.0     145.0

In [159]:
# Percentage contribution of each employee to their department salary total
df['sal_contribution']=df.groupby('department')['salary'].transform('sum')

In [161]:
df

,employee_id,employee,department,salary,bonus,avg_dept,dept_avg,sal_contribution
0,1,A,IT,100,10,115.0,115.0,460
1,2,B,HR,80,5,85.0,85.0,170
2,3,C,IT,120,12,115.0,115.0,460
3,4,D,HR,90,7,85.0,85.0,170
4,5,E,IT,130,15,115.0,115.0,460
5,6,F,Sales,150,20,145.0,145.0,290
6,7,G,Sales,140,18,145.0,145.0,290
7,8,H,IT,110,10,115.0,115.0,460

In [163]:
df['pct']=df['salary']/df['sal_contribution']

In [165]:
df

,employee_id,employee,department,salary,bonus,avg_dept,dept_avg,sal_contribution,pct
0,1,A,IT,100,10,115.0,115.0,460,0.217391
1,2,B,HR,80,5,85.0,85.0,170,0.470588
2,3,C,IT,120,12,115.0,115.0,460,0.260870
3,4,D,HR,90,7,85.0,85.0,170,0.529412
4,5,E,IT,130,15,115.0,115.0,460,0.282609
5,6,F,Sales,150,20,145.0,145.0,290,0.517241
6,7,G,Sales,140,18,145.0,145.0,290,0.482759
7,8,H,IT,110,10,115.0,115.0,460,0.239130

In [167]:
# Salary rank within each department
df['sal_rank']=df.groupby('department')['salary'].rank(ascending=False)

In [169]:
df

,employee_id,employee,department,salary,bonus,avg_dept,dept_avg,sal_contribution,pct,sal_rank
0,1,A,IT,100,10,115.0,115.0,460,0.217391,4.0
1,2,B,HR,80,5,85.0,85.0,170,0.470588,2.0
2,3,C,IT,120,12,115.0,115.0,460,0.260870,2.0
3,4,D,HR,90,7,85.0,85.0,170,0.529412,1.0
4,5,E,IT,130,15,115.0,115.0,460,0.282609,1.0
5,6,F,Sales,150,20,145.0,145.0,290,0.517241,1.0
6,7,G,Sales,140,18,145.0,145.0,290,0.482759,2.0
7,8,H,IT,110,10,115.0,115.0,460,0.239130,3.0

In [191]:
#joining tables

# importing pandas

import pandas as pd

# Creating Dictionary
d = {'id': [1, 2, 10, 12], 
     'val1': ['a', 'b', 'c', 'd']}

a = pd.DataFrame(d)

# printing the dataframe
d = {'id': [1, 2, 9, 8],
     'val2': ['p', 'q', 'r', 's']}
b = pd.DataFrame(d)

In [177]:
a

   id val1
0   1    a
1   2    b
2  10    c
3  12    d

In [179]:
b

   id val1
0   1    p
1   2    q
2   9    r
3   8    s

In [193]:
a.merge(b,on='id')

   id val1 val2
0   1    a    p
1   2    b    q

In [195]:
pd.merge(a,b,on='id')

   id val1 val2
0   1    a    p
1   2    b    q

In [197]:
pd.merge(a,b,on='id',how='left')

   id val1 val2
0   1    a    p
1   2    b    q
2  10    c  NaN
3  12    d  NaN

In [204]:
pd.merge(a,b,how='right')

   id val1 val2
0   1    a    p
1   2    b    q
2   9  NaN    r
3   8  NaN    s

In [206]:
pd.merge(a,b,how='outer')

   id val1 val2
0   1    a    p
1   2    b    q
2   8  NaN    s
3   9  NaN    r
4  10    c  NaN
5  12    d  NaN

In [1]:
'''
Write a python code for for the below question?
Array = [ 2, 1, 6, 8 , -4, -7, -2]
target = 10

write a python code for the numbers which actually meets the target within the array of numbers?

'''

'\nWrite a python code for for the below question?\nArray = [ 2, 1, 6, 8 , -4, -7, -2]\ntarget = 10\n\nwrite a python code for the numbers which actually meets the target within the array of numbers?\n\n'

In [5]:
a=[ 2, 1, 6, 8 , -4, -7, -2]
target=10
b=[]
for i in range (len(a)):
    for j in range(i+1,len(a)):
        if a[i]+a[j]==target:
            b.append((a[i],a[j]))

print(b)

[(2, 8)]

In [ ]:
#Q1 - Given a list of names, convert each name to uppercase.

In [9]:


names = ["alice", "bob", "charlie"]
a=list(map(lambda x : x.upper(),names))
print(a)

['ALICE', 'BOB', 'CHARLIE']

In [17]:
#Q2 - From the list below, keep only numbers greater than 10 and even.
numbers = [3, 10, 12, 15, 18, 21, 24]

a=list(filter(lambda x : (x>10) & (x %2==0) ,numbers))
print(a)

[12, 18, 24]

In [21]:
#Q3 - Filter out odd numbers
# Multiply remaining numbers by 3
nums = [1, 2, 3, 4, 5, 6]
a=list(map(lambda y: y*3,(filter(lambda x : x%2==0,nums))))
print(a)

[6, 12, 18]

In [31]:
#Q3 - Given a list of tuples (name, score), extract only the scores that are greater than 50.

data = [("A", 45), ("B", 67), ("C", 89), ("D", 40)]
a=list(map(lambda y : y[1] ,filter(lambda x : x[1]>50,data)))
print(a)

[67, 89]

In [43]:
# Q5- Boolean Output (Very Important Concept)

words = ["cat", "tiger", "lion", "elephant"]

a=list(map(lambda y : bool( 1 if len(y)>4 else 0),words))
print(a)

[False, True, False, True]

In [45]:
# mental check
result = list(filter(lambda x: x, [0, 1, "", "hello", None, True, False]))
print(result)

[1, 'hello', True]

In [49]:
#Q6- Find the maximum value
from functools import reduce

nums = [3, 7, 2, 9, 5]
a=reduce(lambda x,y : x if x >y else y,nums)
print(a)

9

In [51]:
print(reduce(lambda x, y: x + y, [1, 2, 3, 4])) #10

10

In [53]:
##Q1 - Given a list of names, convert each name to uppercase.
names = ["alice", "bob", "charlie"]
print([x.upper() for x in names])

['ALICE', 'BOB', 'CHARLIE']

In [57]:
#Q2 - From the list below, keep only numbers greater than 10 and even.
numbers = [3, 10, 12, 15, 18, 21, 24]

print([x for x in numbers if x%2==0 & (x>10)])

[10, 12, 18, 24]

In [78]:
#Q3 - Given a list of tuples (name, score), extract only the scores that are greater than 50.
data = [("A", 45), ("B", 67), ("C", 89), ("D", 40)]
print([score for name, score in data if score > 50])

print([x[1] for x in data if x[1]>50])

[67, 89]
[67, 89]

In [61]:
#Q3 - Filter out odd numbers
# Multiply remaining numbers by 3
nums = [1, 2, 3, 4, 5, 6]

print([x*3 for x in nums if x%2==0])

[6, 12, 18]

In [76]:
# Q5- Boolean Output (Very Important Concept)

words = ["cat", "tiger", "lion", "elephant"]
print([ len(x)>4 for x in words  ] )

['cat', 'tiger', 'lion', 'elephant']

In [80]:
matrix = [[1, 2], [3, 4], [5, 6]]
print([x for row in matrix for x in row])

[1, 2, 3, 4, 5, 6]

In [82]:
#Conditional Expression (ifâ€“else inside)
#Replace odd numbers with 0

nums = [1, 2, 3, 4, 5]

print([ x if x%2==0 else 0 for x in nums])

[0, 2, 0, 4, 0]

In [1]:
arr=[int(x) for x in input().split()]
print(arr)

 12 34 56

[12, 34, 56]

In [9]:
from sys import stdin, stdout

n = int(stdin.readline())
arr=[ int(stdin.readline()) for x in range(n)]
print(arr)

ValueError: invalid literal for int() with base 10: ''

In [11]:
n=stdin.readline()
n

''

In [21]:
n=int(input())
a=float(input())
name=input()

print(f"the number is {n}, the float is {a} and the name is {name}")
print("the number is %d, the decimal is %.3f and the name is %s" %(n,a,name))

 10
 34.789
 sree

the number is 10, the float is 34.789 and the name is sree
the number is 10, the decimal is 34.789 and the name is sree

In [37]:
nums = [1,2,2,3,3,3]
s=list(set(nums))
d={}
for i in s:
    d[i]=nums.count(i)

print(d)
#####################################
p={}
for i in range(len(s)):
    count=0
    for j in range(len(nums)):
        if s[i]==nums[j]:
            count+=1
    p[s[i]]=count        
        
print(p)

{1: 1, 2: 2, 3: 3}
{1: 1, 2: 2, 3: 3}

In [45]:
data = [3, 1, 3, 2, 1, 4]
p=list(set(data))
# Output: [3, 1, 2, 4]
print(data,'\n',p)
#.index
#.count
a=[]
for i in data:
    if i not in a:
        a.append(i)
print(a)

[3, 1, 3, 2, 1, 4]
 [1, 2, 3, 4]
[3, 1, 2, 4]

In [102]:
s = "swiss"
# Output: 'w'
a=set(s)
b=[]
for i in a:
    count=0
    for j in range(len(s)):
        if i==s[j]:
            count+=1
    if count==1:
         b.append(i)

print(b)
print(a)

['i', 'w']
{'s', 'i', 'w'}

In [72]:
len(s)

5

In [106]:
s = "swiss"
# Output: 'w'
for i in s:
     if s.count(i)==1:
         print(i)
         break

w

In [131]:
"""
d1 = {'a': 10, 'b': 20}
d2 = {'b': 5, 'c': 15}
# Output: {'a':10, 'b':25, 'c':15}
for k,v in d1.items():
    for i,j in d2.items():
        if k==i:
            d1[k]=v+j
        else:
            d1[i]=d2[j]
            

print(d1)

   """

"\nd1 = {'a': 10, 'b': 20}\nd2 = {'b': 5, 'c': 15}\n# Output: {'a':10, 'b':25, 'c':15}\nfor k,v in d1.items():\n    for i,j in d2.items():\n        if k==i:\n            d1[k]=v+j\n        else:\n            d1[i]=d2[j]\n            \n\nprint(d1)\n\n   "

In [129]:
data = [1, [2,3], 4, [5,6]]
# Output: [1,2,3,4,5,6]

In [139]:

import time

num=list(range(1000000))

start=time.perf_counter()
sum(num)
end=time.perf_counter()

print(end-start)

0.021655099999406957

In [141]:
del num

In [145]:
import time

num1=set((range(1000000)))
num2=(range(1000000))

start=time.perf_counter()
sum(num1)
end=time.perf_counter()

print(end-start)

start=time.perf_counter()
sum(num2)
end=time.perf_counter()

print(end-start)

0.023523100000602426
0.030092899998635403